---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoValidSolutionAtSelectedPoint
source: html/7f499cff-bf0c-712d-b80c-5d90d409a62d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoValidSolutionAtSelectedPoint Property

No valid auto-route solution at selected point.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoValidSolutionAtSelectedPoint { get; }
```